import 'dotenv/config';
import { PrismaClient } from '@prisma/client';
import { PrismaPg } from '@prisma/adapter-pg';

const connectionString = process.env.DATABASE_URL!;

const adapter = new PrismaPg({ connectionString });
const prisma = new PrismaClient({ adapter });

export { prisma };

/*
Бдагодаря это решению мы избегаем создания множества экземпляров PrismaClient во время разработки, что может привести к исчерпанию соединений с базой данных.
Этот паттерн имеет наименование "singleton pattern".

*/


/*
1.1 Что здесь происходит
  import 'dotenv/config'  
  Подтягивает переменные из .env файла в process.env.
  То есть process.env.DATABASE_URL берётся из .env.

1.2 @prisma/adapter-pg + PrismaClient
  PrismaClient — главный клиент ORM Prisma.
  PrismaPg — адаптер, который подключает Prisma к pg (PostgreSQL driver).
  Вместо того, чтобы Prisma сам создавал соединение, ты явно прокидываешь адаптер с connectionString.

1.3. connectionString = process.env.DATABASE_URL!
  Строка подключения к базе (postgres://user:pass@host:port/db).
  ! говорит TypeScript: "я уверен, что это не undefined".

1.4 Singleton-подход (паттерн одиночки)
  Ты создаёшь один экземпляр PrismaClient и экспортируешь его.
  Потом в любом месте проекта импортируешь один и тот же объект prisma.
  Это важно в dev-режиме: если при hot reload постоянно создавать новый PrismaClient, будут утечки соединений к БД и ошибка too many connections.
  🧠 Идея: один процесс → один PrismaClient → контролируемое количество соединений.
*/
